Repository: 84000/data-translation-memory
Catalog: toh557-v3.tmx
Source language: bo
Languages: en

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཅག་ནི་ཆོས་ཀྱིས་ལྷ་དང་ཀླུ་དང་གནོད་སྦྱིན་དང་ལྷ་མ་ཡིན་དང་ནམ་མཁའ་ལྡིང་དང་དྲི་ཟ་དང་མི་འམ་ཅི་དང་ལྟོ་འཕྱེ་ཆེན་པོ་རྣམས་ཀྱི་རྒྱལ་པོ་བགྱིའོ། །
en: “Venerable Bhagavat, through the Dharma we are the kings of devas, nāgas, asuras, garuḍas, gandharvas, kinnaras, and mahoragas.

source: འབྱུང་པོའི་ཚོགས་མི་བཟད་པ་སྙིང་རྗེ་མ་མཆིས་པ་གཞན་གྱི་མདངས་འཕྲོག་པ་རྣམས་བཟློག་པར་བགྱིའོ། །
en: We repel the terrible hosts of cruel bhūtas who steal the vitality of others.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཅག་རྒྱལ་པོ་ཆེན་པོ་བཞི་དང་། གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ཉི་ཤུ་རྩ་བརྒྱད་དང་གནོད་སྦྱིན་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་ལྷན་ཅིག་ཏུ་རྟག་པར་རྒྱུན་དུ་ལྷའི་མིག་རྣམ་པར་དག་པ། མི་ལས་འདས་པས་འཛམ་བུའི་གླིང་ཐམས་ཅད་ལ་བལྟ་བར་བགྱི། བསྲུང་བར་བགྱི། ཡོངས་སུ་བསྐྱང་བར་བགྱི་སྟེ།
en: “Venerable Bhagavat, we Four Mahārājas, and the twenty-eight great generals of the yakṣas and many hundreds of thousands of yakṣas, are continually looking at all of Jambudvīpa with our pure divine vision, which transcends that of humans, and we defend it and protect it.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་དེའི་སླད་དུ། བདག་ཅག་རྒྱལ་པོ་ཆེན་པོ་བཞི་འཇིག་རྟེན་སྐྱོང་ཞེས་མིང་དུ་ཆགས་སོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་གང་སུ་དག་འཛམ་བུའི་གླིང་འདིར།
en: “Venerable Bhagavat, for that reason we Four Mahārājas are given the name world protectors.

source: ཕ་རོལ་གྱི་དམག་ཚོགས་ཀྱིས་ཡུལ་འཇོམས་པར་འགྱུར་རམ། མུ་གེའི་གནོད་པའམ། ནད་ཀྱི་གནོད་པའམ། གནོད་པ་སྣ་ཚོགས་བརྒྱ་དང་གནོད་པ་སྟོང་དང་གནོད་པ་བརྒྱ་ཕྲག་སྟོང་དག་གིས་གཙེས་པར་འགྱུར་བ་ན། བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཅག་རྒྱལ་པོ་ཆེན་པོ་བཞིས་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་འཛིན་པའི་དགེ་སློང་ཆོས་སྨྲ་བ་དེ་དག་ལ་བསྐུལ་བ་བགྱིའོ། །
en: “Venerable Bhagavat, wherever in this Jambudvīpa a country is defeated by an enemy army—or is stricken by the calamity of famine, or the calamity of disease, or a hundred various calamities, a thousand calamities, or a hundred thousand calamities—then, venerable Bhagavat, we Four Mahārājas will inspire the bhikṣus who possess this Lord King of Sūtras, The Sublime Golden Light.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ནམ་བདག་ཅག་རྒྱལ་པོ་ཆེན་པོ་བཞིས་རྫུ་འཕྲུལ་དང་བྱིན་གྱི་རླབས་ཀྱིས་དགེ་སློང་ཆོས་སྨྲ་བ་དེ་དག་ལ་བཀུར་བ་ན། ཡུལ་གང་དང་གང་དུ་མཆི་བར་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ཡུལ་དེ་དང་དེ་དག་ཏུ་རྒྱ་ཆེར་ཡང་དག་པར་སྟོན་པར་འགྱུར་ཏེ། གང་གནོད་པ་སྣ་ཚོགས་བརྒྱ་དང་གནོད་པ་སྟོང་ཡུལ་དུ་འབྱུང་བ་འདི་ལྟ་བུ་འདི་དག་རབ་ཏུ་ཞི་བར་འགྱུར་རོ། །
en: “Venerable Bhagavat, when we Four Mahārājas inspire dharmabhāṇaka bhikṣus through miracles and blessings, they will teach this Lord King of Sūtras, The Sublime Golden Light, in whatever land they are in, and all the various calamities—a hundred calamities, a thousand calamities—that have appeared in that land will cease.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་མིའི་རྒྱལ་པོ་གང་གི་ཡུལ་དུ་མདོ་སྡེའི་དབང་པོ་འཛིན་པའི་དགེ་སློང་ཆོས་སྨྲ་བ་དེ་དག་མཆི་བར་འགྱུར་བའི་ཡུལ་དེ་དག་ཏུ་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ཡང་བསྙེན་པར་འགྱུར་རོ། །
en: “Venerable Bhagavat, in whatever lands there are dharmabhāṇaka bhikṣus who possess this Lord King of Sūtras, The Sublime Golden Light then in those lands The Lord King of Sūtras, The Sublime Golden Light will be heard.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ནམ་མིའི་རྒྱལ་པོས་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ཉན་ཏེ་ཐོས་ནས། མདོ་སྡེའི་དབང་པོ་འཛིན་པའི་དགེ་སློང་དེ་དག་ཕྱིར་རྒོལ་བ་ཐམས་ཅད་ལས་ཀུན་ཏུ་བསྲུང་བར་བགྱིད། ཡོངས་སུ་བསྐྱབ་པ་དང་། ཡོངས་སུ་འཛིན་པ་དང་། ཡོངས་སུ་སྐྱོང་བར་བགྱིད་ན།
en: “Venerable Bhagavat, when a human king listens to and hears this Lord King of Sūtras, The Sublime Golden Light, he will guard those bhikṣus who possess this lord of sūtras from all adversaries; he will defend them, keep them in his care, and protect them.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཅག་རྒྱལ་པོ་ཆེན་པོ་བཞིས། མིའི་རྒྱལ་པོའི་ཡུལ་དེ་ཐམས་ཅད་ན་གནས་པའི་སེམས་ཅན་རྣམས་ཀུན་ཏུ་བསྲུང་བར་བགྱི། ཡོངས་སུ་བསྐྱབ་པ་དང་། ཡོངས་སུ་གཟུང་བ་དང་། ཡོངས་སུ་བསྐྱང་བ་དང་། ཞི་བ་དང་བདེ་ལེགས་སུ་འགྱུར་བར་བགྱིའོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་མིའི་རྒྱལ་པོས་ནམ། དགེ་སློང་ངམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མ་མདོ་སྡེའི་དབང་པོ་འཛིན་པ་ལ།
en: “Venerable Bhagavat, we Four Mahārājas will guard all the beings who dwell in the domain of that human king; we will guard them, defend them, keep them in our care, protect them, and bring them peace and well-being.

source: བདེ་བར་སྦྱར་བ་ཐམས་ཅད་ཀྱིས་བདེ་བར་བགྱིད་ན། བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཅག་རྒྱལ་པོ་ཆེན་པོ་བཞིས། མིའི་རྒྱལ་པོ་དེའི་ཡུལ་ཐམས་ཅད་ན་གནས་པའི་སེམས་ཅན་རྣམས་ལ་བདེ་བའི་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས། བདེ་བ་དང་ཡོ་བྱད་ཐམས་ཅད་ཕུན་སུམ་ཚོགས་པར་བགྱིའོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་ནམ་མིའི་རྒྱལ་པོས་དགེ་སློང་ངམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མའམ།
en: “Venerable Bhagavat, if a human king were to make happy, through whatever brings happiness, the bhikṣus, bhikṣuṇīs, upāsakas, and upāsikās who possess this lord of sūtras, then, venerable Bhagavat, we Four Mahārājas will, through the requisites for happiness, bring the perfection of happiness and requisites to the beings who dwell in all the dominions of those human kings.

source: མདོ་སྡེའི་དབང་པོ་འཛིན་པ་ལ་བསྟི་སྟང་དུ་བགྱིད། བླ་མར་བགྱིད། རིམ་གྲོར་བགྱིད་ཅིང་མཆོད་ན། བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཅག་རྒྱལ་པོ་ཆེན་པོ་བཞིས། མིའི་རྒྱལ་པོ་དེ་ལ་རྒྱལ་པོ་ཐམས་ཅད་པས་ཆེས་བསྟི་སྟང་དུ་བགྱི།
en: “Venerable Bhagavat, when human kings honor, revere, attend upon, and make offerings to the bhikṣus, bhikṣuṇīs, upāsakas, and upāsikās who possess this lord of sūtras, then, venerable Bhagavat, we Four Mahārājas will cause all kings to greatly honor, revere, attend upon, and make offerings to those human kings, and they will be praised in all their dominions.”

source: ཆེས་བླ་མར་བགྱི། ཆེས་རིམ་གྲོར་བགྱི། ཆེས་མཆོད་པར་བགྱི་སྟེ་ཡུལ་ཐམས་ཅད་དུ་ཡང་རབ་ཏུ་བསྔགས་པར་བགྱིའོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་ཆེན་པོ་བཞི་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ་རྒྱལ་པོ་ཆེན་པོ་དག་ལེགས་སོ་ལེགས་སོ། །
en: Then the Bhagavat congratulated the Four Mahārājas, saying, “Excellent, excellent, Mahārājas!

source: རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཡང་ལེགས་སོ་ལེགས་སོ། །
en: Excellent, excellent, you Mahārājas!

source: འདི་ལྟ་སྟེ་ཁྱོད་ནི་སྔོན་གྱི་རྒྱལ་བ་ལ་ལྷག་པར་བྱ་བ་བྱས་པ། དགེ་བའི་རྩ་བ་རྣམས་བསྐྱེད་པ། སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་མང་པོ་ལ་བསྙེན་བཀུར་བྱས་པ་ཆོས་དང་ལྡན་པ་ཆོས་སྨྲ་བ་ཆོས་ཀྱིས་ལྷ་དང་མི་རྣམས་ཀྱི་རྒྱལ་པོ་བྱས་པའོ། །
en: “It is thus: you have served past jinas, have generated roots of merit, have honored many hundreds of thousands of quintillions of buddhas, have possessed the Dharma, have taught the Dharma, and have been kings of devas and humans through the Dharma.

source: འདི་ལྟ་སྟེ་ཁྱོད་ནི་ཡུན་རིང་པོར་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པའི་སེམས་དང་ལྡན་པ། བདེ་བ་དང་བྱམས་པའི་སེམས་དང་ལྡན་པ། སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་བདེ་བར་བྱ་བའི་ལྷག་པའི་བསམ་པ་ལ་ཞུགས་པ། མི་ཕན་པ་ཐམས་ཅད་འགོག་པ། སེམས་ཅན་ཐམས་ཅད་ལ་བདེ་བ་ཐམས་ཅད་ཉེ་བར་བསྒྲུབ་པར་བརྩོན་པ་ཡིན་ཏེ།
en: “It is thus: for a long time, you have had the motivation to benefit all beings; you have had the motivation of happiness and love; you have had the superior motivation of wishing to bring benefit and happiness to all beings; you have prevented that which is not beneficial; and you have been dedicated to accomplishing every happiness for all beings.

source: རྒྱལ་པོ་ཆེན་པོ་ཁྱེད་བཞིས། མིའི་རྒྱལ་པོ་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ལ་མཆོད་པ་དང་རིམ་གྲོ་བྱེད་པར་བརྩོན་པ་དེ་དག་ལ་ཀུན་ཏུ་བསྲུང་བར་གྱིས་ཤིག །ཡོངས་སུ་བསྐྱབ་པ་དང་། ཡོངས་སུ་གཟུང་བ་དང་། ཡོངས་སུ་བསྐྱང་བ་དང་། ཆད་པ་སྤང་བ་དང་། ཞི་བ་དང་བདེ་ལེགས་སུ་འགྱུར་བར་གྱིས་ཤིག །
en: “You Four Mahārājas have guarded the kings who have been dedicated to honoring and making offerings to The Lord King of Sūtras, The Sublime Golden Light, and defended them, kept them in your care, protected them, saved them from attack, and brought them peace and well-being.

source: དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་དཔུང་དང་། གཡོག་དང་། གནོད་སྦྱིན་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་བཅས་པ་ཁྱེད་བཞིས་འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་ཆོས་ཀྱི་ཚུལ་ཀུན་ཏུ་བསྲུང་བར་འགྱུར་རོ། །
en: “Therefore, you Four Mahārājas, with your army, attendants, and many hundreds of thousands of yakṣas, will guard the way of the Dharma of the buddha bhagavats of the past, future, and present.

source: ཡོངས་སུ་བསྐྱང་བ་དང་ཡོངས་སུ་གཟུང་བར་ཡང་འགྱུར་རོ། །
en: You will protect it and keep it in your care.

source: དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་དཔུང་དང་། གཡོག་དང་། གནོད་སྦྱིན་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་བཅས་པ་ཁྱེད་བཞི་ལྷ་དང་ལྷ་མ་ཡིན་དུ་གཡུལ་འགྱེད་པ་ན་རྒྱལ་བར་འགྱུར་རོ། །
en: “Therefore, you Four Mahārājas, with your army, attendants, and many hundreds of thousands of yakṣas, will be victorious in the battle between the devas and asuras.

source: ལྷ་མ་ཡིན་རྣམས་ཕམ་པར་འགྱུར་རོ། །
en: You will defeat the asuras.

source: འདི་ལྟར་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་ཕ་རོལ་གྱི་དམག་ཚོགས་ཐམས་ཅད་འདུལ་བར་བྱེད་པ་འདིའི་ཕྱིར།
en: In this way, The Lord King of Sūtras, The Sublime Golden Light subjugates all opposing armies.

source: དགེ་སློང་ངམ་དགེ་སློང་མའམ་དགེ་བསྙེན་ནམ་དགེ་བསྙེན་མ་མདོ་སྡེའི་དབང་པོ་འཛིན་པ།
en: For that reason, you should guard the bhikṣus, bhikṣuṇīs, upāsakas, and upāsikās who possess this lord of sūtras.

source: དེ་དག་ལ་ཀུན་ཏུ་བསྲུང་བ་གྱིས་ཤིག །ཡོངས་སུ་བསྐྱབ་པ་དང་། ཡོངས་སུ་གཟུང་བ་དང་། ཡོངས་སུ་བསྐྱང་བ་དང་། ཞི་བ་དང་བདེ་ལེགས་སུ་འགྱུར་བར་གྱིས་ཤིག །དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་ཀྱི་བུ་དང་། རྒྱལ་པོ་ཆེན་པོ་ཡུལ་འཁོར་སྲུང་དང་། རྒྱལ་པོ་ཆེན་པོ་འཕགས་སྐྱེས་པོ་དང་། རྒྱལ་པོ་ཆེན་པོ་མིག་མི་བཟང་སྟན་ལས་ལངས་ཏེ། གོས་ཕྲག་པ་གཅིག་ཏུ་བགོས་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་མ་འོངས་པའི་དུས་ན་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི། གྲོང་ངམ། གྲོང་ཁྱེར་རམ། གྲོང་རྡལ་ལམ། ལྗོངས་སམ། ཡུལ་འཁོར་རམ། ཕོ་བྲང་འཁོར་གང་དུ་སྤྱོད་པར་འགྱུར་བ་དང་། མིའི་རྒྱལ་པོ་གང་དང་གང་གི་ཡུལ་དུ་སྤྱོད་པར་འགྱུར་བ་དང་། བཙུན་པ་བཅོམ་ལྡན་འདས་མིའི་རྒྱལ་པོར་གྱུར་པ་གང་ལ་ལ་ཞིག་ལྷའི་དབང་པོའི་དམ་ཚིག་རྒྱལ་པོའི་བསྟན་བཅོས་འདིས། རྒྱལ་པོ་བགྱིད་ཅིང་རྟག་པར་རྒྱུན་དུ་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ཉན་ཏམ། རིམ་གྲོ་བགྱིད་དམ། མཆོད་པ་བགྱིད་དམ། དགེ་སློང་ངམ། དགེ་སློང་མ་འམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འཛིན་པ་དེ་དག་ལ་ཡང་བསྟི་སྟང་བགྱིད།
en: You should defend them, keep them in your care, protect them, and bring them peace and well-being.”

source: བཙུན་པར་བགྱིད། རིམ་གྲོར་བགྱིད་ཅིང་མཆོད་དེ་རྟག་པར་རྒྱུན་དུ་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་ཉན་ན། ཆོས་མཉན་པའི་ཆུ་བོའི་ཆུ་ཆོས་བདུད་རྩིའི་ཁུ་བ་འདིས་བདག་ཅག་རྒྱལ་པོ་ཆེན་པོ་བཞི་དང་། གཡོག་རྣམས་དང་གནོད་སྦྱིན་བརྒྱ་སྟོང་ཕྲག་དུ་མའི་ལྷའི་ལུས་འདི་དག་གཟི་བརྗིད་ཆེན་པོ་རྣམ་པར་འཕེལ་བར་འགྱུར། བདག་ཅག་ལ་བརྩོན་འགྲུས་དང་མཐུ་དང་སྟོབས་ཆེན་པོར་ཡང་བགྱིད་པར་འགྱུར།
en: Then Mahārāja Vaiśravaṇa, Mahārāja Dhṛtarāṣṭra, Mahārāja Virūḍhaka, and Mahārāja Virūpākṣa rose from their seats, and with their upper robes over one shoulder, they knelt on their right knee and, with palms together in homage, bowed toward the Bhagavat and said, “Venerable Bhagavat, in the future, when this Lord King of Sūtras, The Sublime Golden Light is performed in any village, town, market town, district, kingdom, or royal capital; when it is performed in the domain of any human king; and when, venerable Bhagavat, any human king who acts as a king in accordance with the commitment of the lord of devas and with this treatise on kingship, and always listens to, worships, and makes offerings to this Lord King of Sūtras, The Sublime Golden Light, and honors, venerates, worships, and makes offerings to the bhikṣus, bhikṣuṇīs, upāsakas, and upāsikās who possess this Lord King of Sūtras, and always listens to this Lord King of Sūtras, The Sublime Golden Light, then at that time, through the liquid amṛta of this Dharma, through the water of the river of listening to the Dharma, the divine bodies of we Four Mahārājas and our army, attendants, and many hundred thousands of yakṣas will increase in their great magnificence, and we will have great diligence, power, and strength.

source: བདག་གི་གཟི་བརྗིད་དང་དཔལ་དང་། ཕུན་སུམ་ཚོགས་པ་ཡང་རྣམ་པར་འཕེལ་བར་འགྱུར་རོ། །
en: Our magnificence, splendor, and good fortune will also increase.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཅག་རྒྱལ་པོ་ཆེན་པོ་བཞི་དཔུང་དང་གཡོག་ཏུ་བཅས་པ་གནོད་སྦྱིན་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་ལུས་བལྟར་མི་གདའ་བར་བགྱིས་ཏེ། ད་ལྟར་དང་མ་འོངས་པའི་དུས་ན་གྲོང་ངམ། གྲོང་ཁྱེར་རམ། གྲོང་རྡལ་ལམ། ལྗོངས་སམ། ཡུལ་འཁོར་རམ།
en: “Venerable Bhagavat, we Four Mahārājas, with our army, attendants, and many hundreds of thousands of yakṣas, will now and in future times be present in these very bodies in any village, town, market town, district, kingdom, or royal capital where this Lord King of Sūtras, The Sublime Golden Light is performed.

source: ཕོ་བྲང་འཁོར་གང་ན། གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་སྤྱོད་པར་འགྱུར་བ་དེ་དག་ཏུ་མཆི་བར་བགྱིའོ། །མིའི་རྒྱལ་པོ་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་མཉན་པ་དང་། རིམ་གྲོ་བགྱིད་པ་དང་། མཆོད་པ་བགྱིད་པ་དེ་དག་ལ་ཀུན་ཏུ་བསྲུང་བར་བགྱིའོ། །
en: “We will guard the human kings who listen to, worship, and make offerings to this Lord King of Sūtras, the Sublime Golden Light.

source: ཡོངས་སུ་བསྐྱབ་པ་དང་། ཡོངས་སུ་གཟུང་བ་དང་། ཡོངས་སུ་བསྐྱང་བ་དང་། ཆད་པ་སྤང་བ་དང་། ཞི་བ་དང་བདེ་ལེགས་སུ་འགྱུར་བར་བགྱིའོ། །
en: We will defend them, keep them in our care, protect them, save them from attack, and bring them peace and well-being.

source: རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་དེ་དག་དང་ཡུལ་འཁོར་དེ་དག་དང་ཡུལ་དེ་དག་ཀྱང་ཀུན་ཏུ་བསྲུང་བར་བགྱིའོ། །
en: “We will guard the royal courts, the kingdoms, and their dominions.

source: ཡུལ་དེ་དག་ཀྱང་འཇིག་པ་དང་གནོད་པ་དང་། འཁྲུག་པ་ཐམས་ཅད་ལས་ཡོངས་སུ་ཐར་བར་བགྱིའོ། །ཕ་རོལ་གྱི་དམག་ཚོགས་རྣམས་ཀྱང་སླར་བཟློག་པར་བགྱིའོ། །མིའི་རྒྱལ་པོ་གང་ལ་ལ་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་མཉན་པ་དང་། རིམ་གྲོ་བགྱིད་པ་དང་། མཆོད་པ་བགྱིད་པ་དེའི་དགྲ་ཟླ་འདབ་ཉེ་བའི་རྒྱལ་པོ་གཞན་ཞིག་མཆིས་ལ།
en: We will free those dominions from all fear, harm, and disturbances, and we will repel the armies of enemies.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ནམ་དགྲ་ཟླ་འདབ་ཉེ་བའི་རྒྱལ་པོ་དེ་འདི་སྙམ་དུ་བདག་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པ་དང་ལྷན་ཅིག་ཏུ་ཡུལ་དེར་སོང་སྟེ། ཡུལ་དེ་རྣམ་པར་གཞིག་གོ་སྙམ་དུ་སེམས་བསྐྱེད་ན། བཙུན་པ་བཅོམ་ལྡན་འདས་དེའི་ཚེ་དེའི་དུས་ན། གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདིའི་གཟི་བརྗིད་ཀྱི་མཐུས་དགྲ་ཟླ་འདབ་ཉེ་བའི་རྒྱལ་པོ་དེ་རྒྱལ་པོ་གཞན་དག་དང་གཡུལ་འགྱེད་པར་འགྱུར། རང་གི་ཡུལ་དུ་ཕྱིན་ན་ཡང་།
en: “If a human king who listens to, worships, and makes offerings to this Lord King of Sūtras, The Sublime Golden Light has a neighboring enemy king, and if, venerable Bhagavat, that king thinks, ‘I will go with my fourfold army to that domain to destroy it,’ then, venerable Bhagavat, at that time, in that time, through the power of the magnificence of this Lord King of Sūtras, The Sublime Golden Light, that neighboring enemy king will enter into battle with other kings, who will enter his domain and bring ruin to his domain.

source: ཡུལ་འཁྲུག་པར་འགྱུར། རྒྱལ་པོའི་འཁྲུག་པ་མི་བཟད་པ་ཡང་འབྱུང་བར་འགྱུར།
en: They will bring dreadful ruin to that king.

source: ཡུལ་དུ་གཟའ་དང་ནད་ཀྱང་འབྱུང་བར་འགྱུར།
en: Bad planetary influences and diseases will also appear in his domain.

source: ཡུལ་དུ་བྲེལ་བ་སྣ་ཚོགས་བརྒྱ་དག་ཀྱང་འབྱུང་བར་འགྱུར་རོ། །
en: There will be hundreds of various kinds of difficulties in his domain.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ནམ་དགྲ་ཟླ་འདབ་ཉེ་བའི་རྒྱལ་པོ་དེ་རང་གི་ཡུལ་དུ་ཕྱིན་པ་ན། གནོད་པ་སྣ་ཚོགས་བརྒྱ་དང་བྲེལ་བ་སྣ་ཚོགས་བརྒྱ་འདི་ལྟ་བུ་འབྱུང་ངོ་། །
en: “Venerable Bhagavat, if a neighboring enemy king goes to that king’s domain, there will be hundreds of various kinds of calamities and hundreds of various kinds of tribulations.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་དགྲ་ཟླ་འདབ་ཉེ་བའི་རྒྱལ་པོ་དེ་ཡན་ལག་བཞི་པའི་དམག་བསོགས་ཏེ། ཕ་རོལ་གྱི་དམག་ཚོགས་སུ་མཆི་བའི་སླད་དུ་རང་གི་ཡུལ་ནས་བྱུང་སྟེ། དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པ་དང་ལྷན་ཅིག་ཏུ་ཡུལ་དེར་མཆི་འཚལ་བ་དང་། གང་ན་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་གནས་པའི་ཡུལ་དེ་རྣམ་པར་གཞིག་འཚལ་བར་གྱུར་ན། བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཅག་རྒྱལ་པོ་ཆེན་པོ་བཞི་དཔུང་དང་གཡོག་ཏུ་བཅས་པ། གནོད་སྦྱིན་བརྒྱ་སྟོང་དུ་མ་དང་ལྷན་ཅིག་ཏུ་ལུས་མི་གདའ་བར་བགྱིས་ཏེ་དེར་མཆི་བར་བགྱིའོ། །ཕ་རོལ་གྱི་དམག་ཚོགས་དེ་ཡུལ་དུ་ཞུགས་པ་ལས་ཀྱང་།
en: “Venerable Bhagavat, if a neighboring enemy king gathers together his fourfold army and leaves his domain as an invading army and with those four divisions of his army enters another domain in order to destroy a domain where this Lord King of Sūtras, The Sublime Golden Light, is present, then, venerable Bhagavat, we Four Mahārājas, with our army, attendants, and countless hundreds of thousands of yakṣas, in these very bodies, will go there, and we will drive back the enemy army that is en route.

source: དེ་ཉིད་ནས་ལྡོག་པར་བགྱིའོ། །བྲེལ་བ་རྣམ་པ་སྣ་ཚོགས་བརྒྱ་དག་ཀྱང་ཉེ་བར་བསྒྲུབ་པར་བགྱིའོ། །
en: We will cause them hundreds of various calamities and create obstacles for them.

source: བགེགས་ཀྱང་བགྱིའོ། །འདི་ལྟ་སྟེ་ཡུལ་དེར་ཕ་རོལ་དམག་ཚོགས་དེ་མཆི་བར་ཡང་མི་ནུས་ན། ཡུལ་གཞིག་པར་བགྱིད་པར་ལྟ་ག་ལ་འགྱུར།
en: In that way, the army of the enemy will not even be able to enter that domain, let alone cause its destruction.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་ཆེན་པོ་བཞི་པོ་དག་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ། རྒྱལ་པོ་ཆེན་པོ་དག་ལེགས་སོ་ལེགས་སོ། །
en: Then the Bhagavat congratulated the Four Mahārājas, saying, “Excellent, excellent, Mahārājas!

source: རྒྱལ་པོ་ཆེན་པོ་དག་ཁྱེད་ཡང་ལེགས་ཏེ།
en: Excellent, excellent, you Mahārājas!

source: ཁྱེད་བསྐལ་པ་གྲངས་མེད་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་ཡང་དག་པར་བསྒྲུབས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་འདིའི་ཕྱིར། མིའི་རྒྱལ་པོ་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ཉན་པ་དང་། རིམ་གྲོ་བྱེད་པ་དང་། མཆོད་པ་བྱེད་པ་དེ་དག་ལ་ཀུན་ཏུ་བསྲུང་བ་གྱིས་ཤིག །ཡོངས་སུ་བསྐྱབ་པ་དང་། ཡོངས་སུ་གཟུང་བ་དང་། ཡོངས་སུ་བསྐྱང་བ་དང་། ཆད་པ་སྤང་བ་དང་།
en: You have accomplished this for many hundreds of thousands of quintillions of asaṃkhyeya eons, and for the sake of the highest, most complete enlightenment you should guard, defend, keep in your care, protect, save from attack, and bring peace and well-being to a human king who listens to, worships, and makes offerings to this Lord King of Sūtras, The Sublime Golden Light.

source: ཞི་བ་དང་བདེ་ལེགས་སུ་འགྱུར་བར་གྱིས་ཤིག །རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་དེ་དག་དང་། གྲོང་ཁྱེར་དེ་དག་དང་། ཡུལ་འཁོར་དེ་དག་དང་། ཡུལ་དེ་དག་ཀྱང་ཀུན་ཏུ་སྲུངས་ཤིག །ཡོངས་སུ་བསྐྱབ་པ་དང་།
en: “You should also guard, defend, keep in your care, protect, save from attack, and bring peace and well-being to their royal courts, cities, kingdoms, and dominions.

source: ཡོངས་སུ་གཟུང་བ་དང་། ཡོངས་སུ་བསྐྱང་བ་དང་། ཆད་པ་སྤང་བ་དང་། ཞི་བ་དང་བདེ་ལེགས་སུ་འགྱུར་བར་གྱིས་ཤིག །ཡུལ་དེ་དག་ཀྱང་འཇིགས་པ་དང་གནོད་པ་དང་འཁྲུག་པ་ཐམས་ཅད་ལས་ཡོངས་སུ་ཐར་བར་གྱིས་ཤིག །
en: You should also free those dominions from all fear, harm, and disturbances.

source: ཕ་རོལ་གྱི་དམག་ཚོགས་རྣམས་ཀྱང་ཟློག་ཅིག །
en: You should repel the armies of enemies.

source: འཛམ་བུའི་གླིང་ཐམས་ཅད་ན་གནས་པའི་མིའི་རྒྱལ་པོ་དག་མི་འཐབ་པ་དང་། མཚང་མི་འདྲུ་བ་དང་། མི་རྩོད་པ་དང་། མི་འགྱེད་པར་བྱ་བ་ལ་སྤྲོ་བར་གྱིས་ཤིག །
en: “You should be eager for there to be no fighting, no quarreling, no contention, and no disputes among the human kings who dwell throughout all of Jambudvīpa.

source: རྒྱལ་པོ་ཆེན་པོ་དཔུང་དང་གཡོག་ཏུ་བཅས་པ་ཁྱེད་བཞིའི་འཛམ་བུའི་གླིང་འདིར་ནམ་གྲོང་ཁྱེར་བརྒྱད་ཁྲི་བཞི་སྟོང་དེ་དག་ན། རྒྱལ་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་དེ་དག་རང་རང་གི་ཡུལ་ལ་མངོན་པར་དགའ་བ་དང་།
en: “In this Jambudvīpa of yours, you Four Mahārājas and your army and attendants, may the eighty-four thousand kings in the eighty-four thousand cities each delight in their own domains.

source: རྒྱལ་སྲིད་ཀྱི་དབང་ཕྱུག་དེས་མངོན་པར་དགའ་བ་དང་།
en: May they each delight in their own sovereignty.

source: རང་གི་ནོར་གྱི་ཕུང་པོས་ཕན་ཚུན་རྣམ་པར་མི་འཚེ་བ་དང་།
en: May they not be harmful to each other’s aggregation of wealth.

source: ཕན་ཚུན་རྣམ་པར་འཚེ་བ་མི་བསྐྱེད་པ་དང་།
en: May they not attack each other.

source: རང་གིས་ཇི་ལྟར་སྔོན་གྱི་ལས་བསགས་པས་རྒྱལ་པོ་ཐོབ་པའི་རང་གི་རྒྱལ་སྲིད་ཀྱི་དབང་ཕྱུག་གིས་དགའ་བ་དང་།
en: May the kings be happy with the sovereignty that they have obtained through their own accumulation of karma in the past.

source: ཕན་ཚུན་དུ་ཡུལ་འཇིག་པར་མི་བྱེད་པ་དང་།
en: May they not destroy each other’s dominion.

source: ཡུལ་གཞིག་པའི་ཕྱིར་ཕ་རོལ་གྱི་གནོད་པ་དང་།
en: May they not cause harm to each other in order to destroy each other’s dominion.

source: ནམ་འཛམ་བུའི་གླིང་འདིར་གྲོང་ཁྱེར་བརྒྱད་ཁྲི་བཞི་སྟོང་དག་ན་རྒྱལ་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་དེ་དག་ཕན་ཚུན་དུ་བྱམས་པའི་སེམས་སུ་འགྱུར། བྱམས་པའི་སེམས་དང་ཕན་པའི་སེམས་སུ་འགྱུར་ཏེ། ཕན་ཚུན་དུ་མི་འཐབ་མཚང་མི་འདྲུ་མི་རྩོད་མི་འགྱེད་པར་རང་རང་གི་ཡུལ་དག་ན་དགའ་བར་འགྱུར་ན། དེའི་ཕྱིར་རྒྱལ་པོ་ཆེན་པོ་དཔུང་དང་གཡོག་ཏུ་བཅས་པ་ཁྱེད་བཞི་འཛམ་བུའི་གླིང་འདི་རྒྱས་པར་འགྱུར།
en: “When the eighty-four thousand kings in the eighty-four thousand cities in this Jambudvīpa are loving toward each other; when they have loving and altruistic minds; when they have no fighting, no quarreling, no contention, and no disputes among them and are each happy with their own domains, because of that, you Four Mahārājas, your army and attendants, and this Jambudvīpa will flourish.

source: ལོ་ལེགས་པར་འགྱུར།
en: It will have good harvests.

source: ཉམས་དགའ་བར་འགྱུར།
en: It will be delightful.

source: སྐྱེ་བོ་མང་པོ་དང་མིས་གང་བར་འགྱུར།
en: It will be filled with many people.

source: ས་ཡང་མདངས་ཅན་དུ་འགྱུར།
en: It will have fertile earth.

source: དུས་དང་ཟླ་བ་དང་ཟླ་བ་ཕྱེད་དང་ལོ་ཁྱུད་ཀོར་ཐམས་ཅད་ཀྱང་ཡང་དག་པའི་དུས་དང་ལྡན་པར་འགྱུར། གཟའ་དང་།
en: The cycles of periods of time, months, fortnights, and years will be fortuitous.

source: རྒྱུ་སྐར་དང་། ཟླ་བ་དང་། ཉི་མ་ཡང་ཉིན་མཚན་དུ་ལེགས་པར་རྒྱུ་བར་འགྱུར།
en: Both day and night, the planets, the lunar asterisms, the moon, and the sun will move harmoniously.

source: ཆར་པའི་རྒྱུན་ཡང་ས་ལ་དུས་དུས་སུ་འབབ་པར་འགྱུར།
en: The rain will fall on the earth at the appropriate times.

source: འཛམ་བུའི་གླིང་ཐམས་ཅད་ན་གནས་པའི་སེམས་ཅན་རྣམས་ཀྱང་ནོར་དང་འབྲུ་ཐམས་ཅད་འབྱོར་པར་འགྱུར།
en: The beings who dwell in Jambudvīpa will have all wealth and grain.

source: ལོངས་སྤྱོད་ཆེ་བ་དང་། སེར་སྣ་མེད་པར་འགྱུར།
en: They will have numerous possessions, without miserliness.

source: གཏོང་བ་དང་ལྡན་པར་འགྱུར།
en: They will be generous.

source: དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དང་ལྡན་པར་འགྱུར།
en: They will follow the path of the ten good actions.

source: ཕལ་ཆེར་བདེ་འགྲོ་མཐོ་རིས་ཀྱི་འཇིག་རྟེན་དུ་སྐྱེ་བར་འགྱུར།
en: Most will be reborn in the higher blissful realms.

source: ལྷའི་ཁང་ཁྱིམ་རྣམས་ཀྱང་ལྷ་དང་ལྷའི་བུ་རྣམས་ཀྱིས་གང་བར་འགྱུར་རོ། །རྒྱལ་པོ་ཆེན་པོ་དག་གང་ལ་ལ་ཞིག་མིའི་རྒྱལ་པོར་གྱུར་ལ་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ཉན་པར་གྱུར་ཏེ། རིམ་གྲོ་བྱས། མཆོད་པ་བྱས། དགེ་སློང་ངམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མ་མདོ་སྡེའི་དབང་པོ་འཛིན་པ་དེ་དག་ལ་ཡང་བསྟི་སྟང་བྱེད། བླ་མར་བྱེད།
en: The mansions of the devas will be filled with devas and their children.

source: རིམ་གྲོར་བྱེད། མཆོད་པར་བྱེད་ཅིང་། རྒྱལ་པོ་ཆེན་པོ་ཁྱེད་བཞི་དཔུང་དང་གཡོག་ཏུ་བཅས་པ་གནོད་སྦྱིན་སྟོང་ཕྲག་དུ་མ་ལ་སྙིང་བརྩེ་བའི་ཕྱིར་རྟག་པར་རྒྱུན་དུ་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ཉན་ན། ཆོས་ཉན་པའི་ཆུའི་ཀླུང་ཆོས་བདུད་རྩིའི་ཁུ་བ་འདིས་ཁྱེད་ཅག་གི་ལུས་འདི་དག་ཚིམ་པར་འགྱུར་རོ། །ཁྱེད་ཀྱི་ལྷའི་ལུས་འདི་དག་གི་གཟི་བྱིན་ཆེན་པོ་ཡང་རྣམ་པར་འཕེལ་ལོ། །
en: “Mahārājas, where there is a human king who listens to, worships, and makes offerings to this Lord King of Sūtras, The Sublime Golden Light; and honors, venerates, worships, and makes offerings to the bhikṣus, bhikṣuṇīs, upāsakas, and upāsikās who possess this Lord King of Sūtras, the Sublime Golden Light; and who, out of kindness to you Four Mahārājas, your army and attendants, and your many hundred thousands of yakṣas, always listens to this Lord King of Sūtras, The Sublime Golden Light, then through the water of the river of listening to the Dharma, the liquid amṛta of this Dharma, your divine bodies will be refreshed, and your divine bodies will increase in their great magnificence, and you will develop diligence, power, and strength.

source: ཁྱེད་ཀྱི་བརྩོན་འགྲུས་དང་མཐུ་དང་སྟོབས་ཀྱང་བསྐྱེད་དོ། །ཁྱེད་ཀྱི་གཟི་བརྗིད་དང་དཔལ་དང་ཕུན་སུམ་ཚོགས་པ་ཡང་རྣམ་པར་འཕེལ་ལོ། །
en: Your magnificence, splendor, and good fortune will also increase.

source: མིའི་རྒྱལ་པོ་དེས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ང་ལ་ཡང་མཆོད་པ་བསམ་གྱིས་མི་ཁྱབ་པ་རྒྱ་ཆེན་པོ་ཡངས་པ་བྱས་པར་འགྱུར་རོ། །
en: “Those human kings will have also made inconceivably vast offerings to me, the tathāgata arhat samyaksaṃbuddha Śākyamuni.
